codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz0512efe144.h
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNFC             /* 0xBF8602B0 */
  .extern ANSELD           /* 0xBF860300 */
  .extern ANSELDCLR        /* 0xBF860304 */
  .extern ANSELDSET        /* 0xBF860308 */
  .extern ANSELDINV        /* 0xBF86030C */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNFD             /* 0xBF8603B0 */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
  .extern CNCONESET        /* 0xBF860478 */
  .extern CNCONEINV        /* 0xBF86047C */
  .extern CNENE            /* 0xBF860480 */
  .extern CNENECLR         /* 0xBF860484 */
  .extern CNENESET         /* 0xBF860488 */
  .extern CNENEINV         /* 0xBF86048C */
  .extern CNSTATE          /* 0xBF860490 */
  .extern CNSTATECLR       /* 0xBF860494 */
  .extern CNSTATESET       /* 0xBF860498 */
  .extern CNSTATEINV       /* 0xBF86049C */
  .extern CNNEE            /* 0xBF8604A0 */
  .extern CNFE             /* 0xBF8604B0 */
  .extern SRCON0E          /* 0xBF8604C0 */
  .extern SRCON1E          /* 0xBF8604D0 */
  .extern ANSELF           /* 0xBF860500 */
  .extern ANSELFCLR        /* 0xBF860504 */
  .extern ANSELFSET        /* 0xBF860508 */
  .extern ANSELFINV        /* 0xBF86050C */
  .extern TRISF            /* 0xBF860510 */
  .extern TRISFCLR         /* 0xBF860514 */
  .extern TRISFSET         /* 0xBF860518 */
  .extern TRISFINV         /* 0xBF86051C */
  .extern PORTF            /* 0xBF860520 */
  .extern PORTFCLR         /* 0xBF860524 */
  .extern PORTFSET         /* 0xBF860528 */
  .extern PORTFINV         /* 0xBF86052C */
  .extern LATF             /* 0xBF860530 */
  .extern LATFCLR          /* 0xBF860534 */
  .extern LATFSET          /* 0xBF860538 */
  .extern LATFINV          /* 0xBF86053C */
  .extern ODCF             /* 0xBF860540 */
  .extern ODCFCLR          /* 0xBF860544 */
  .extern ODCFSET          /* 0xBF860548 */
  .extern ODCFINV          /* 0xBF86054C */
  .extern CNPUF            /* 0xBF860550 */
  .extern CNPUFCLR         /* 0xBF860554 */
  .extern CNPUFSET         /* 0xBF860558 */
  .extern CNPUFINV         /* 0xBF86055C */
  .extern CNPDF            /* 0xBF860560 */
  .extern CNPDFCLR         /* 0xBF860564 */
  .extern CNPDFSET         /* 0xBF860568 */
  .extern CNPDFINV         /* 0xBF86056C */
  .extern CNCONF           /* 0xBF860570 */
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern CNNEF            /* 0xBF8605A0 */
  .extern CNFF             /* 0xBF8605B0 */
  .extern SRCON0F          /* 0xBF8605C0 */
  .extern SRCON1F          /* 0xBF8605D0 */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern CNNEG            /* 0xBF8606A0 */
  .extern CNFG             /* 0xBF8606B0 */
  .extern SRCON0G          /* 0xBF8606C0 */
  .extern SRCON1G          /* 0xBF8606D0 */
  .extern ANSELH           /* 0xBF860700 */
  .extern ANSELHCLR        /* 0xBF860704 */
  .extern ANSELHSET        /* 0xBF860708 */
  .extern ANSELHINV        /* 0xBF86070C */
  .extern TRISH            /* 0xBF860710 */
  .extern TRISHCLR         /* 0xBF860714 */
  .extern TRISHSET         /* 0xBF860718 */
  .extern TRISHINV         /* 0xBF86071C */
  .extern PORTH            /* 0xBF860720 */
  .extern PORTHCLR         /* 0xBF860724 */
  .extern PORTHSET         /* 0xBF860728 */
  .extern PORTHINV         /* 0xBF86072C */
  .extern LATH             /* 0xBF860730 */
  .extern LATHCLR          /* 0xBF860734 */
  .extern LATHSET          /* 0xBF860738 */
  .extern LATHINV          /* 0xBF86073C */
  .extern ODCH             /* 0xBF860740 */
  .extern ODCHCLR          /* 0xBF860744 */
  .extern ODCHSET          /* 0xBF860748 */
  .extern ODCHINV          /* 0xBF86074C */
  .extern CNPUH            /* 0xBF860750 */
  .extern CNPUHCLR         /* 0xBF860754 */
  .extern CNPUHSET         /* 0xBF860758 */
  .extern CNPUHINV         /* 0xBF86075C */
  .extern CNPDH            /* 0xBF860760 */
  .extern CNPDHCLR         /* 0xBF860764 */
  .extern CNPDHSET         /* 0xBF860768 */
  .extern CNPDHINV         /* 0xBF86076C */
  .extern CNCONH           /* 0xBF860770 */
  .extern CNCONHCLR        /* 0xBF860774 */
  .extern CNCONHSET        /* 0xBF860778 */
  .extern CNCONHINV        /* 0xBF86077C */
  .extern CNENH            /* 0xBF860780 */
  .extern CNENHCLR         /* 0xBF860784 */
  .extern CNENHSET         /* 0xBF860788 */
  .extern CNENHINV         /* 0xBF86078C */
  .extern CNSTATH          /* 0xBF860790 */
  .extern CNSTATHCLR       /* 0xBF860794 */
  .extern CNSTATHSET       /* 0xBF860798 */
  .extern CNSTATHINV       /* 0xBF86079C */
  .extern CNNEH            /* 0xBF8607A0 */
  .extern CNFH             /* 0xBF8607B0 */
  .extern ANSELJ           /* 0xBF860800 */
  .extern ANSELJCLR        /* 0xBF860804 */
  .extern ANSELJSET        /* 0xBF860808 */
  .extern ANSELJINV        /* 0xBF86080C */
  .extern TRISJ            /* 0xBF860810 */
  .extern TRISJCLR         /* 0xBF860814 */
  .extern TRISJSET         /* 0xBF860818 */
  .extern TRISJINV         /* 0xBF86081C */
  .extern PORTJ            /* 0xBF860820 */
  .extern PORTJCLR         /* 0xBF860824 */
  .extern PORTJSET         /* 0xBF860828 */
  .extern PORTJINV         /* 0xBF86082C */
  .extern LATJ             /* 0xBF860830 */
  .extern LATJCLR          /* 0xBF860834 */
  .extern LATJSET          /* 0xBF860838 */
  .extern LATJINV          /* 0xBF86083C */
  .extern ODCJ             /* 0xBF860840 */
  .extern ODCJCLR          /* 0xBF860844 */
  .extern ODCJSET          /* 0xBF860848 */
  .extern ODCJINV          /* 0xBF86084C */
  .extern CNPUJ            /* 0xBF860850 */
  .extern CNPUJCLR         /* 0xBF860854 */
  .extern CNPUJSET         /* 0xBF860858 */
  .extern CNPUJINV         /* 0xBF86085C */
  .extern CNPDJ            /* 0xBF860860 */
  .extern CNPDJCLR         /* 0xBF860864 */
  .extern CNPDJSET         /* 0xBF860868 */
  .extern CNPDJINV         /* 0xBF86086C */
  .extern CNCONJ           /* 0xBF860870 */
  .extern CNCONJCLR        /* 0xBF860874 */
  .extern CNCONJSET        /* 0xBF860878 */
  .extern CNCONJINV        /* 0xBF86087C */
  .extern CNENJ            /* 0xBF860880 */
  .extern CNENJCLR         /* 0xBF860884 */
  .extern CNENJSET         /* 0xBF860888 */
  .extern CNENJINV         /* 0xBF86088C */
  .extern CNSTATJ          /* 0xBF860890 */
  .extern CNSTATJCLR       /* 0xBF860894 */
  .extern CNSTATJSET       /* 0xBF860898 */
  .extern CNSTATJINV       /* 0xBF86089C */
  .extern CNNEJ            /* 0xBF8608A0 */
  .extern CNFJ             /* 0xBF8608B0 */
  .extern TRISK            /* 0xBF860910 */
  .extern TRISKCLR         /* 0xBF860914 */
  .extern TRISKSET         /* 0xBF860918 */
  .extern TRISKINV         /* 0xBF86091C */
  .extern PORTK            /* 0xBF860920 */
  .extern PORTKCLR         /* 0xBF860924 */
  .extern PORTKSET         /* 0xBF860928 */
  .extern PORTKINV         /* 0xBF86092C */
  .extern LATK             /* 0xBF860930 */
  .extern LATKCLR          /* 0xBF860934 */
  .extern LATKSET          /* 0xBF860938 */
  .extern LATKINV          /* 0xBF86093C */
  .extern ODCK             /* 0xBF860940 */
  .extern ODCKCLR          /* 0xBF860944 */
  .extern ODCKSET          /* 0xBF860948 */
  .extern ODCKINV          /* 0xBF86094C */
  .extern CNPUK            /* 0xBF860950 */
  .extern CNPUKCLR         /* 0xBF860954 */
  .extern CNPUKSET         /* 0xBF860958 */
  .extern CNPUKINV         /* 0xBF86095C */
  .extern CNPDK            /* 0xBF860960 */
  .extern CNPDKCLR         /* 0xBF860964 */
  .extern CNPDKSET         /* 0xBF860968 */
  .extern CNPDKINV         /* 0xBF86096C */
  .extern CNCONK           /* 0xBF860970 */
  .extern CNCONKCLR        /* 0xBF860974 */
  .extern CNCONKSET        /* 0xBF860978 */
  .extern CNCONKINV        /* 0xBF86097C */
  .extern CNENK            /* 0xBF860980 */
  .extern CNENKCLR         /* 0xBF860984 */
  .extern CNENKSET         /* 0xBF860988 */
  .extern CNENKINV         /* 0xBF86098C */
  .extern CNSTATK          /* 0xBF860990 */
  .extern CNSTATKCLR       /* 0xBF860994 */
  .extern CNSTATKSET       /* 0xBF860998 */
  .extern CNSTATKINV       /* 0xBF86099C */
  .extern CNNEK            /* 0xBF8609A0 */
  .extern CNFK             /* 0xBF8609B0 */
  .extern ETHCON1          /* 0xBF882000 */
  .extern ETHCON1CLR       /* 0xBF882004 */
  .extern ETHCON1SET       /* 0xBF882008 */
  .extern ETHCON1INV       /* 0xBF88200C */
  .extern ETHCON2          /* 0xBF882010 */
  .extern ETHCON2CLR       /* 0xBF882014 */
  .extern ETHCON2SET       /* 0xBF882018 */
  .extern ETHCON2INV       /* 0xBF88201C */
  .extern ETHTXST          /* 0xBF882020 */
  .extern ETHTXSTCLR       /* 0xBF882024 */
  .extern ETHTXSTSET       /* 0xBF882028 */
  .extern ETHTXSTINV       /* 0xBF88202C */
  .extern ETHRXST          /* 0xBF882030 */
  .extern ETHRXSTCLR       /* 0xBF882034 */
  .extern ETHRXSTSET       /* 0xBF882038 */
  .extern ETHRXSTINV       /* 0xBF88203C */
  .extern ETHHT0           /* 0xBF882040 */
  .extern ETHHT0CLR        /* 0xBF882044 */
  .extern ETHHT0SET        /* 0xBF882048 */
  .extern ETHHT0INV        /* 0xBF88204C */
  .extern ETHHT1           /* 0xBF882050 */
  .extern ETHHT1CLR        /* 0xBF882054 */
  .extern ETHHT1SET        /* 0xBF882058 */
  .extern ETHHT1INV        /* 0xBF88205C */
  .extern ETHPMM0          /* 0xBF882060 */
  .extern ETHPMM0CLR       /* 0xBF882064 */
  .extern ETHPMM0SET       /* 0xBF882068 */
  .extern ETHPMM0INV       /* 0xBF88206C */
  .extern ETHPMM1          /* 0xBF882070 */
  .extern ETHPMM1CLR       /* 0xBF882074 */
  .extern ETHPMM1SET       /* 0xBF882078 */
  .extern ETHPMM1INV       /* 0xBF88207C */
  .extern ETHPMCS          /* 0xBF882080 */
  .extern ETHPMCSCLR       /* 0xBF882084 */
  .extern ETHPMCSSET       /* 0xBF882088 */
  .extern ETHPMCSINV       /* 0xBF88208C */
  .extern ETHPMO           /* 0xBF882090 */
  .extern ETHPMOCLR        /* 0xBF882094 */
  .extern ETHPMOSET        /* 0xBF882098 */
  .extern ETHPMOINV        /* 0xBF88209C */
  .extern ETHRXFC          /* 0xBF8820A0 */
  .extern ETHRXFCCLR       /* 0xBF8820A4 */
  .extern ETHRXFCSET       /* 0xBF8820A8 */
  .extern ETHRXFCINV       /* 0xBF8820AC */
  .extern ETHRXWM          /* 0xBF8820B0 */
  .extern ETHRXWMCLR       /* 0xBF8820B4 */
  .extern ETHRXWMSET       /* 0xBF8820B8 */
  .extern ETHRXWMINV       /* 0xBF8820BC */
  .extern ETHIEN           /* 0xBF8820C0 */
  .extern ETHIENCLR        /* 0xBF8820C4 */
  .extern ETHIENSET        /* 0xBF8820C8 */
  .extern ETHIENINV        /* 0xBF8820CC */
  .extern ETHIRQ           /* 0xBF8820D0 */
  .extern ETHIRQCLR        /* 0xBF8820D4 */
  .extern ETHIRQSET        /* 0xBF8820D8 */
  .extern ETHIRQINV        /* 0xBF8820DC */
  .extern ETHSTAT          /* 0xBF8820E0 */
  .extern ETHSTATCLR       /* 0xBF8820E4 */
  .extern ETHSTATSET       /* 0xBF8820E8 */
  .extern ETHSTATINV       /* 0xBF8820EC */
  .extern ETHRXOVFLOW      /* 0xBF882100 */
  .extern ETHRXOVFLOWCLR   /* 0xBF882104 */
  .extern ETHRXOVFLOWSET   /* 0xBF882108 */
  .extern ETHRXOVFLOWINV   /* 0xBF88210C */
  .extern ETHFRMTXOK       /* 0xBF882110 */
  .extern ETHFRMTXOKCLR    /* 0xBF882114 */
  .extern ETHFRMTXOKSET    /* 0xBF882118 */
  .extern ETHFRMTXOKINV    /* 0xBF88211C */
  .extern ETHSCOLFRM       /* 0xBF882120 */
  .extern ETHSCOLFRMCLR    /* 0xBF882124 */
  .extern ETHSCOLFRMSET    /* 0xBF882128 */
  .extern ETHSCOLFRMINV    /* 0xBF88212C */
  .extern ETHMCOLFRM       /* 0xBF882130 */
  .extern ETHMCOLFRMCLR    /* 0xBF882134 */
  .extern ETHMCOLFRMSET    /* 0xBF882138 */
  .extern ETHMCOLFRMINV    /* 0xBF88213C */
  .extern ETHFRMRXOK       /* 0xBF882140 */
  .extern ETHFRMRXOKCLR    /* 0xBF882144 */
  .extern ETHFRMRXOKSET    /* 0xBF882148 */
  .extern ETHFRMRXOKINV    /* 0xBF88214C */
  .extern ETHFCSERR        /* 0xBF882150 */
  .extern ETHFCSERRCLR     /* 0xBF882154 */
  .extern ETHFCSERRSET     /* 0xBF882158 */
  .extern ETHFCSERRINV     /* 0xBF88215C */
  .extern ETHALGNERR       /* 0xBF882160 */
  .extern ETHALGNERRCLR    /* 0xBF882164 */
  .extern ETHALGNERRSET    /* 0xBF882168 */
  .extern ETHALGNERRINV    /* 0xBF88216C */
  .extern EMAC1CFG1        /* 0xBF882200 */
  .extern EMACxCFG1        /* 0xBF882200 */
  .extern EMAC1CFG1CLR     /* 0xBF882204 */
  .extern EMACxCFG1CLR     /* 0xBF882204 */
  .extern EMAC1CFG1SET     /* 0xBF882208 */
  .extern EMACxCFG1SET     /* 0xBF882208 */
  .extern EMAC1CFG1INV     /* 0xBF88220C */
  .extern EMACxCFG1INV     /* 0xBF88220C */
  .extern EMAC1CFG2        /* 0xBF882210 */
  .extern EMACxCFG2        /* 0xBF882210 */
  .extern EMAC1CFG2CLR     /* 0xBF882214 */
  .extern EMACxCFG2CLR     /* 0xBF882214 */
  .extern EMAC1CFG2SET     /* 0xBF882218 */
  .extern EMACxCFG2SET     /* 0xBF882218 */
  .extern EMAC1CFG2INV     /* 0xBF88221C */
  .extern EMACxCFG2INV     /* 0xBF88221C */
  .extern EMAC1IPGT        /* 0xBF882220 */
  .extern EMACxIPGT        /* 0xBF882220 */
  .extern EMAC1IPGTCLR     /* 0xBF882224 */
  .extern EMACxIPGTCLR     /* 0xBF882224 */
  .extern EMAC1IPGTSET     /* 0xBF882228 */
  .extern EMACxIPGTSET     /* 0xBF882228 */
  .extern EMAC1IPGTINV     /* 0xBF88222C */
  .extern EMACxIPGTINV     /* 0xBF88222C */
  .extern EMAC1IPGR        /* 0xBF882230 */
  .extern EMACxIPGR        /* 0xBF882230 */
  .extern EMAC1IPGRCLR     /* 0xBF882234 */
  .extern EMACxIPGRCLR     /* 0xBF882234 */
  .extern EMAC1IPGRSET     /* 0xBF882238 */
  .extern EMACxIPGRSET     /* 0xBF882238 */
  .extern EMAC1IPGRINV     /* 0xBF88223C */
  .extern EMACxIPGRINV     /* 0xBF88223C */
  .extern EMAC1CLRT        /* 0xBF882240 */
  .extern EMACxCLRT        /* 0xBF882240 */
  .extern EMAC1CLRTCLR     /* 0xBF882244 */
  .extern EMACxCLRTCLR     /* 0xBF882244 */
  .extern EMAC1CLRTSET     /* 0xBF882248 */
  .extern EMACxCLRTSET     /* 0xBF882248 */
  .extern EMAC1CLRTINV     /* 0xBF88224C */
  .extern EMACxCLRTINV     /* 0xBF88224C */
  .extern EMAC1MAXF        /* 0xBF882250 */
  .extern EMACxMAXF        /* 0xBF882250 */
  .extern EMAC1MAXFCLR     /* 0xBF882254 */
  .extern EMACxMAXFCLR     /* 0xBF882254 */
  .extern EMAC1MAXFSET     /* 0xBF882258 */
  .extern EMACxMAXFSET     /* 0xBF882258 */
  .extern EMAC1MAXFINV     /* 0xBF88225C */
  .extern EMACxMAXFINV     /* 0xBF88225C */
  .extern EMAC1SUPP        /* 0xBF882260 */
  .extern EMACxSUPP        /* 0xBF882260 */
  .extern EMAC1SUPPCLR     /* 0xBF882264 */
  .extern EMACxSUPPCLR     /* 0xBF882264 */
  .extern EMAC1SUPPSET     /* 0xBF882268 */
  .extern EMACxSUPPSET     /* 0xBF882268 */
  .extern EMAC1SUPPINV     /* 0xBF88226C */
  .extern EMACxSUPPINV     /* 0xBF88226C */
  .extern EMAC1TEST        /* 0xBF882270 */
  .extern EMACxTEST        /* 0xBF882270 */
  .extern EMAC1TESTCLR     /* 0xBF882274 */
  .extern EMACxTESTCLR     /* 0xBF882274 */
  .extern EMAC1TESTSET     /* 0xBF882278 */
  .extern EMACxTESTSET     /* 0xBF882278 */
  .extern EMAC1TESTINV     /* 0xBF88227C */
  .extern EMACxTESTINV     /* 0xBF88227C */
  .extern EMAC1MCFG        /* 0xBF882280 */
  .extern EMACxMCFG        /* 0xBF882280 */
  .extern EMAC1MCFGCLR     /* 0xBF882284 */
  .extern EMACxMCFGCLR     /* 0xBF882284 */
  .extern EMAC1MCFGSET     /* 0xBF882288 */
  .extern EMACxMCFGSET     /* 0xBF882288 */
  .extern EMAC1MCFGINV     /* 0xBF88228C */
  .extern EMACxMCFGINV     /* 0xBF88228C */
  .extern EMAC1MCMD        /* 0xBF882290 */
  .extern EMACxMCMD        /* 0xBF882290 */
  .extern EMAC1MCMDCLR     /* 0xBF882294 */
  .extern EMACxMCMDCLR     /* 0xBF882294 */
  .extern EMAC1MCMDSET     /* 0xBF882298 */
  .extern EMACxMCMDSET     /* 0xBF882298 */
  .extern EMAC1MCMDINV     /* 0xBF88229C */
  .extern EMACxMCMDINV     /* 0xBF88229C */
  .extern EMAC1MADR        /* 0xBF8822A0 */
  .extern EMACxMADR        /* 0xBF8822A0 */
  .extern EMAC1MADRCLR     /* 0xBF8822A4 */
  .extern EMACxMADRCLR     /* 0xBF8822A4 */
  .extern EMAC1MADRSET     /* 0xBF8822A8 */
  .extern EMACxMADRSET     /* 0xBF8822A8 */
  .extern EMAC1MADRINV     /* 0xBF8822AC */
  .extern EMACxMADRINV     /* 0xBF8822AC */
  .extern EMAC1MWTD        /* 0xBF8822B0 */
  .extern EMACxMWTD        /* 0xBF8822B0 */
  .extern EMAC1MWTDCLR     /* 0xBF8822B4 */
  .extern EMACxMWTDCLR     /* 0xBF8822B4 */
  .extern EMAC1MWTDSET     /* 0xBF8822B8 */
  .extern EMACxMWTDSET     /* 0xBF8822B8 */
  .extern EMAC1MWTDINV     /* 0xBF8822BC */
  .extern EMACxMWTDINV     /* 0xBF8822BC */
  .extern EMAC1MRDD        /* 0xBF8822C0 */
  .extern EMACxMRDD        /* 0xBF8822C0 */
  .extern EMAC1MRDDCLR     /* 0xBF8822C4 */
  .extern EMACxMRDDCLR     /* 0xBF8822C4 */
  .extern EMAC1MRDDSET     /* 0xBF8822C8 */
  .extern EMACxMRDDSET     /* 0xBF8822C8 */
  .extern EMAC1MRDDINV     /* 0xBF8822CC */
  .extern EMACxMRDDINV     /* 0xBF8822CC */
  .extern EMAC1MIND        /* 0xBF8822D0 */
  .extern EMACxMIND        /* 0xBF8822D0 */
  .extern EMAC1MINDCLR     /* 0xBF8822D4 */
  .extern EMACxMINDCLR     /* 0xBF8822D4 */
  .extern EMAC1MINDSET     /* 0xBF8822D8 */
  .extern EMACxMINDSET     /* 0xBF8822D8 */
  .extern EMAC1MINDINV     /* 0xBF8822DC */
  .extern EMACxMINDINV     /* 0xBF8822DC */
  .extern EMAC1SA0         /* 0xBF882300 */
  .extern EMACxSA0         /* 0xBF882300 */
  .extern EMAC1SA0CLR      /* 0xBF882304 */
  .extern EMACxSA0CLR      /* 0xBF882304 */
  .extern EMAC1SA0SET      /* 0xBF882308 */
  .extern EMACxSA0SET      /* 0xBF882308 */
  .extern EMAC1SA0INV      /* 0xBF88230C */
  .extern EMACxSA0INV      /* 0xBF88230C */
  .extern EMAC1SA1         /* 0xBF882310 */
  .extern EMACxSA1         /* 0xBF882310 */
  .extern EMAC1SA1CLR      /* 0xBF882314 */
  .extern EMACxSA1CLR      /* 0xBF882314 */
  .extern EMAC1SA1SET      /* 0xBF882318 */
  .extern EMACxSA1SET      /* 0xBF882318 */
  .extern EMAC1SA1INV      /* 0xBF88231C */
  .extern EMACxSA1INV      /* 0xBF88231C */
  .extern EMAC1SA2         /* 0xBF882320 */
  .extern EMACxSA2         /* 0xBF882320 */
  .extern EMAC1SA2CLR      /* 0xBF882324 */
  .extern EMACxSA2CLR      /* 0xBF882324 */
  .extern EMAC1SA2SET      /* 0xBF882328 */
  .extern EMACxSA2SET      /* 0xBF882328 */
  .extern EMAC1SA2INV      /* 0xBF88232C */
  .extern EMACxSA2INV      /* 0xBF88232C */
  .extern USBCRCON         /* 0xBF884000 */
  .extern PRECON           /* 0xBF8E0000 */
  .extern PRECONCLR        /* 0xBF8E0004 */
  .extern PRECONSET        /* 0xBF8E0008 */
  .extern PRECONINV        /* 0xBF8E000C */
  .extern PRESTAT          /* 0xBF8E0010 */
  .extern PRESTATCLR       /* 0xBF8E0014 */
  .extern PRESTATSET       /* 0xBF8E0018 */
  .extern PRESTATINV       /* 0xBF8E001C */
  .extern EBICS0           /* 0xBF8E1014 */
  .extern EBICS1           /* 0xBF8E1018 */
  .extern EBICS2           /* 0xBF8E101C */
  .extern EBICS3           /* 0xBF8E1020 */
  .extern EBIMSK0          /* 0xBF8E1054 */
